---
kind: enumMember
id: F:Autodesk.Revit.DB.ChangePriority.MEPCalculations
enum: Autodesk.Revit.DB.ChangePriority
source: html/9db16841-106b-23bb-0c29-42017edcf69f.htm
---
# Autodesk.Revit.DB.ChangePriority.MEPCalculations

Updater will update MEP calculated values